In [1]:
import numpy as np
import pandas as pd

# Reindex Method

In [9]:
color_series = pd.Series(['Red', 'Green', 'Blue'], index=[0, 3, 6])
color_series

0      Red
3    Green
6     Blue
dtype: object

In [10]:
#range(n), method will gives you value from 0 to n-1, range() increase the index value
#reindex(), might create new rows for the series
#reindex(), will gives you values with some specific index of the series
color_series = color_series.reindex(range(9), method='ffill')
color_series

0      Red
1      Red
2      Red
3    Green
4    Green
5    Green
6     Blue
7     Blue
8     Blue
dtype: object

In [17]:
color_series_two = pd.Series(['Redish', 'Greenish', 'Purple'], index=[0, 4, 8])
color_series_two

0      Redish
4    Greenish
8      Purple
dtype: object

In [18]:
color_series_two = color_series_two.reindex(range(12))
print(color_series_two) #NaN values is because new index don't have values as we create

0       Redish
1          NaN
2          NaN
3          NaN
4     Greenish
5          NaN
6          NaN
7          NaN
8       Purple
9          NaN
10         NaN
11         NaN
dtype: object

In [21]:
#to remove NaN value, we use a parameter called 'method'
color_series_three = pd.Series(['Yellow', 'Greenish', 'Purple'], index=[0, 4, 8])
color_series_three
#the parameter 'method' fill NaN value with the range of values as above series have
#NaN value will be convert into previous value in the series
color_series_three.reindex(range(12), method='ffill')

0       Yellow
1       Yellow
2       Yellow
3       Yellow
4     Greenish
5     Greenish
6     Greenish
7     Greenish
8       Purple
9       Purple
10      Purple
11      Purple
dtype: object

# Reindex with ffil

In [30]:
cities = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['A', 'B', 'C', 'D'],
                     columns = ['one', 'two', 'three', 'four'])

cities

   one  two  three  four
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11
D   12   13     14    15

In [31]:
#index must be monotonic increasing or decreasing
cities = cities.reindex(['A', 'B', 'C', 'D', 'E'], method='ffill')
cities

   one  two  three  four
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11
D   12   13     14    15
E   12   13     14    15

In [35]:
cities_one = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['A', 'B', 'C', 'D'],
                     columns = ['one', 'two', 'three', 'four'])

cities_one

   one  two  three  four
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11
D   12   13     14    15

In [36]:
#gives NaN values without ffill 
cities_one = cities_one.reindex(['A', 'B', 'C', 'D', 'E'])
cities_one

    one   two  three  four
A   0.0   1.0    2.0   3.0
B   4.0   5.0    6.0   7.0
C   8.0   9.0   10.0  11.0
D  12.0  13.0   14.0  15.0
E   NaN   NaN    NaN   NaN

In [38]:
#changing columns name by reindexing
cities_two = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['one', 'two', 'three', 'four'],
                     columns = ['Karachi', 'Lahore', 'Peshawar', 'Islamabad'])

cities_two

       Karachi  Lahore  Peshawar  Islamabad
one          0       1         2          3
two          4       5         6          7
three        8       9        10         11
four        12      13        14         15

In [43]:
cities_name = ['Karachi', 'Lahore', 'Peshawar', 'Islamabad', 'Multan']
cities_two = cities_two.reindex(columns = cities_name)
cities_two

       Karachi  Lahore  Peshawar  Islamabad  Multan
one          0       1         2          3     NaN
two          4       5         6          7     NaN
three        8       9        10         11     NaN
four        12      13        14         15     NaN

In [45]:
#new dataframe
cities_three = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['one', 'two', 'three', 'four'],
                     columns = ['Karachi', 'Lahore', 'Peshawar', 'Islamabad'])

cities_three

       Karachi  Lahore  Peshawar  Islamabad
one          0       1         2          3
two          4       5         6          7
three        8       9        10         11
four        12      13        14         15

In [48]:
#cities_three = cities_three.reindex(columns = cities_name, method='ffill')
#cities_three